{"modelTopology":{"class_name":"Model","config":{"name":"model3","layers":[{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,null,30],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"dense_Dense7","class_name":"Dense","config":{"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true},"inbound_nodes":[[["input3",0,0,{}]]]},{"name":"dense_Dense8","class_name":"Dense","config":{"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true},"inbound_nodes":[[["dense_Dense7",0,0,{}]]]},{"name":"dense_Dense9","class_name":"Dense","config":{"units":3,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense9","trainable":true},"inbound_nodes":[[["dense_Dense8",0,0,{}]]]}],"input_layers":[["input3",0,0]],"output_layers":[["dense_Dense9",0,0]]},"keras_version":"tfjs-layers 2.6.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.6.0","convertedBy":null,"weightsManifest":[{"paths":["./mymodel.weights.bin"],"weights":[{"name":"dense_Dense7/kernel","shape":[30,64],"dtype":"float32"},{"name":"dense_Dense7/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense8/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense8/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense9/kernel","shape":[64,3],"dtype":"float32"},{"name":"dense_Dense9/bias","shape":[3],"dtype":"float32"}]}]}