{"modelTopology":{"class_name":"Model","config":{"name":"model4","layers":[{"name":"input4","class_name":"InputLayer","config":{"batch_input_shape":[null,null,33],"dtype":"float32","sparse":false,"name":"input4"},"inbound_nodes":[]},{"name":"dense_Dense10","class_name":"Dense","config":{"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10","trainable":true},"inbound_nodes":[[["input4",0,0,{}]]]},{"name":"dense_Dense11","class_name":"Dense","config":{"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true},"inbound_nodes":[[["dense_Dense10",0,0,{}]]]},{"name":"dense_Dense12","class_name":"Dense","config":{"units":3,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true},"inbound_nodes":[[["dense_Dense11",0,0,{}]]]}],"input_layers":[["input4",0,0]],"output_layers":[["dense_Dense12",0,0]]},"keras_version":"tfjs-layers 2.8.1","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.8.1","convertedBy":null,"weightsManifest":[{"paths":["./policy.weights.bin"],"weights":[{"name":"dense_Dense10/kernel","shape":[33,64],"dtype":"float32"},{"name":"dense_Dense10/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense11/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense12/kernel","shape":[64,3],"dtype":"float32"},{"name":"dense_Dense12/bias","shape":[3],"dtype":"float32"}]}]}