{"modelTopology":{"class_name":"Model","config":{"name":"model5","layers":[{"name":"input5","class_name":"InputLayer","config":{"batch_input_shape":[null,null,33],"dtype":"float32","sparse":false,"name":"input5"},"inbound_nodes":[]},{"name":"dense_Dense13","class_name":"Dense","config":{"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true},"inbound_nodes":[[["input5",0,0,{}]]]},{"name":"dense_Dense14","class_name":"Dense","config":{"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense14","trainable":true},"inbound_nodes":[[["dense_Dense13",0,0,{}]]]},{"name":"dense_Dense15","class_name":"Dense","config":{"units":3,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense15","trainable":true},"inbound_nodes":[[["dense_Dense14",0,0,{}]]]}],"input_layers":[["input5",0,0]],"output_layers":[["dense_Dense15",0,0]]},"keras_version":"tfjs-layers 2.8.1","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.8.1","convertedBy":null,"weightsManifest":[{"paths":["./value.weights.bin"],"weights":[{"name":"dense_Dense13/kernel","shape":[33,64],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense14/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense14/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense15/kernel","shape":[64,3],"dtype":"float32"},{"name":"dense_Dense15/bias","shape":[3],"dtype":"float32"}]}]}